Revit 2024 API
FamilyParameter Methods
The FamilyParameter type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUnitTypeId
Gets the identifier of the unit quantifying the parameter value.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace